
## Plan Result

[CI link](https://github.com/morisoba00/aws-ecs-terraform/actions/runs/5099492713)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_route53_record.d-wiki_record
* Delete
  * aws_route53_record.record


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_route53_record.d-wiki_record will be created
  + resource "aws_route53_record" "d-wiki_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "d-wiki.com"
      + type            = "A"
      + zone_id         = "Z080441839FKQW0XEUU54"

      + alias {
          + evaluate_target_health = true
          + name                   = "go-simple-server-alb-88156255.ap-northeast-1.elb.amazonaws.com"
          + zone_id                = "Z14GRHDCWA56QT"
        }
    }

  # aws_route53_record.record will be destroyed
  # (because aws_route53_record.record is not in configuration)
  - resource "aws_route53_record" "record" {
      - fqdn                             = "d-wiki.com" -> null
      - id                               = "Z080441839FKQW0XEUU54_d-wiki.com_A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "d-wiki.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z080441839FKQW0XEUU54" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "go-simple-server-alb-88156255.ap-northeast-1.elb.amazonaws.com" -> null
          - zone_id                = "Z14GRHDCWA56QT" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":21,"Program":"tfcmt","SHA1":"30a64aaccea978ab7d9a5fb782f7390aa5ea9ed2","Vars":{},"WorkflowName":"Terraform"} -->